# переменные
my_var = 100
myVar2 = 200

z = my_var + myVar2
# комментирование ctrl+/
# print(z)

# закглавными буквами пишутся константы
PI = 3.14

# ***типы данных***
_int = 100000
_float = 500.001

my_str = 'Привет "Мир" !'
# print (my_str)
# print (PI)
# print (_int)
# print (_float)

# булевы типы данных (boolean, bool)
# два значение будевых типов данных (true/false)
my_bool = True # истина, логическая 1, false - лог 0

# ***способ форматирования строк под названием "f-строка"***
# старейший способ форматирования - конкатенация
g = 'Hello'
r = ' '
q = ', World!'

s = g + r + q 
# print (s)

res = f" первое слово: {g} второе слово: {r} третье слово = {q}"
# print (res)


# *** арифметические операции***

var_1 = 3
var_2 = 5

# операция сложения
print(var_1 + var_2)

# операция вычитания
print(var_1 - var_2)

# операция умножения
print(var_1 * var_2)

# операция простого деления
print(var_1 / var_2)

